===========================================
Expression Assignment for AlgebraicDataType
===========================================

foo = Bar

---

(source_file
  (assignment
    leftHandSide: (leftHandSideVariable 
      name: (identifier)
    )
	value: (expression
      (expressionAlgebraicDataType
    	name: (identifier)
   	  )
    )
  )
)

================================
Expression Assignment for Record
================================

foo = { foo = Bar }

---

(source_file
  (assignment
    leftHandSide: (leftHandSideVariable 
      name: (identifier)
    )
  	value: (expression
      (expressionRecord
    	name: (identifier)
        value: (expression
          (expressionAlgebraicDataType
            name: (identifier)
          )
     	)
      )
    )
  )
)

==============================
Expression Assignment for List
==============================

foo = [ Bar ]

---

(source_file
  (assignment
    leftHandSide: (leftHandSideVariable 
      name: (identifier)
    )
  	value: (expression
      (expressionList
        value: (expression
          (expressionAlgebraicDataType
            name: (identifier)
          )
        )
   	  )
    )
  )
)


==================================
Expression Assignment for Function
==================================

foo = \Bar -> Baz

---

(source_file
  (assignment
    leftHandSide: (leftHandSideVariable 
      name: (identifier)
    )
  	value: (expression
      (expressionFunction
        parameter: (leftHandSideAlgebraicDataType
          name: (identifier)
        )
        body: (expression
          (expressionAlgebraicDataType
            name: (identifier)
          )
        )
   	  )
    )
  )
)

================================
Expression Assignment for String
================================

foo = "foo"

---

(source_file
  (assignment
    leftHandSide: (leftHandSideVariable 
      name: (identifier)
    )
	value: (expression
      (expressionString
         text
       )
    )
  )
)

